# (Extra) Formas de Seleções

In [6]:
import pandas as pd

In [7]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 10, 11, 12),
        (13, 14, 15, 16)]
df = pd.DataFrame(data=data, index='l1 l2 l3 l4'.split(), columns='c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [9]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [10]:
df[['c3', 'c2']]

    c3  c2
l1   3   2
l2   7   6
l3  11  10
l4  15  14

In [11]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [13]:
df[1:3][['c1', 'c2', 'c3', 'c4']]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [16]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [15]:
df.loc['l2']

c1    5
c2    6
c3    7
c4    8
Name: l2, dtype: int64

In [18]:
df.loc[['l1', 'l3']]

    c1  c2  c3  c4
l1   1   2   3   4
l3   8  10  11  12

In [22]:
df.loc['l2', 'c3']

7

In [29]:
df.loc[['l1', 'l2'], ['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6

In [28]:
df.iloc[0]

c1    1
c2    2
c3    3
c4    4
Name: l1, dtype: int64

In [24]:
df.iloc[3, 0]

13

In [27]:
df.iloc[[3, 1]]

    c1  c2  c3  c4
l4  13  14  15  16
l2   5   6   7   8

In [32]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [31]:
df.iloc[[0, 1], [0, 1]]

    c1  c2
l1   1   2
l2   5   6